Turing-zero/esp32-support-test/components/spi/main/app_main.c
/* SPI Slave example, receiver (uses SPI Slave driver to communicate with sender)

   This example code is in the Public Domain (or CC0 licensed, at your option.)

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/
#include <stdio.h>
#include <stdint.h>
#include <stddef.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "esp_log.h"
#include "driver/spi_slave.h"
#include "driver/gpio.h"

/*
SPI receiver (slave) example.

This example is supposed to work together with the SPI sender. It uses the standard SPI pins (MISO, MOSI, SCLK, CS) to
transmit data over in a full-duplex fashion, that is, while the master puts data on the MOSI pin, the slave puts its own
data on the MISO pin.

This example uses one extra pin: GPIO_HANDSHAKE is used as a handshake pin. After a transmission has been set up and we're
ready to send/receive data, this code uses a callback to set the handshake pin high. The sender will detect this and start
sending a transaction. As soon as the transaction is done, the line gets set low again.
*/

/*
Pins in use. The SPI Master can use the GPIO mux, so feel free to change these if needed.
*/
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
#define GPIO_HANDSHAKE 2
#define GPIO_MOSI 12
#define GPIO_MISO 13
#define GPIO_SCLK 15
#define GPIO_CS 14

#elif CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C2
#define GPIO_HANDSHAKE 3
#define GPIO_MOSI 7
#define GPIO_MISO 2
#define GPIO_SCLK 6
#define GPIO_CS 10

#elif CONFIG_IDF_TARGET_ESP32C6
#define GPIO_HANDSHAKE 15
#define GPIO_MOSI 19
#define GPIO_MISO 20
#define GPIO_SCLK 18
#define GPIO_CS 9

#elif CONFIG_IDF_TARGET_ESP32H2
#define GPIO_HANDSHAKE 2
#define GPIO_MOSI 5
#define GPIO_MISO 0
#define GPIO_SCLK 4
#define GPIO_CS 1

#elif CONFIG_IDF_TARGET_ESP32S3
#define GPIO_HANDSHAKE 2
#define GPIO_MOSI 11
#define GPIO_MISO 13
#define GPIO_SCLK 12
#define GPIO_CS 10

#endif //CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2

#ifdef CONFIG_IDF_TARGET_ESP32
#define RCV_HOST    HSPI_HOST

#else
#define RCV_HOST    SPI2_HOST

#endif

//Called after a transaction is queued and ready for pickup by master. We use this to set the handshake line high.
void my_post_setup_cb(spi_slave_transaction_t *trans)
{
    gpio_set_level(GPIO_HANDSHAKE, 1);
}

//Called after transaction is sent/received. We use this to set the handshake line low.
void my_post_trans_cb(spi_slave_transaction_t *trans)
{
    gpio_set_level(GPIO_HANDSHAKE, 0);
}

//Main application
void app_main(void)
{
    int n = 0;
    esp_err_t ret;

    //Configuration for the SPI bus
    spi_bus_config_t buscfg = {
        .mosi_io_num = GPIO_MOSI,
        .miso_io_num = GPIO_MISO,
        .sclk_io_num = GPIO_SCLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
    };

    //Configuration for the SPI slave interface
    spi_slave_interface_config_t slvcfg = {
        .mode = 0,
        .spics_io_num = GPIO_CS,
        .queue_size = 1,
        // .flags = 0,
        // .post_setup_cb = my_post_setup_cb,
        // .post_trans_cb = my_post_trans_cb
    };

    //Configuration for the handshake line
    // gpio_config_t io_conf = {
    //     .intr_type = GPIO_INTR_DISABLE,
    //     .mode = GPIO_MODE_OUTPUT,
    //     .pin_bit_mask = (1 << GPIO_HANDSHAKE)
    // };

    //Configure handshake line as output
    // gpio_config(&io_conf);
    //Enable pull-ups on SPI lines so we don't detect rogue pulses when no master is connected.
    // gpio_set_pull_mode(GPIO_MOSI, GPIO_PULLUP_ONLY);
    // gpio_set_pull_mode(GPIO_SCLK, GPIO_PULLUP_ONLY);
    // gpio_set_pull_mode(GPIO_CS, GPIO_PULLUP_ONLY);

    //Initialize SPI slave interface
    ret = spi_slave_initialize(RCV_HOST, &buscfg, &slvcfg, SPI_DMA_CH_AUTO);
    assert(ret == ESP_OK);

    WORD_ALIGNED_ATTR char sendbuf[129] = "";
    WORD_ALIGNED_ATTR char recvbuf[129] = "";
    memset(recvbuf, 0, 33);
    spi_slave_transaction_t t;
    memset(&t, 0, sizeof(t));

    struct COMM_STATUS {
        int rx_count;
        int tx_count;

        int rx_index_start;
        int rx_index_end;
        int success_rate;
    } comm_status;

    comm_status.rx_count = 0;
    comm_status.rx_index_end=0;
    comm_status.rx_index_start=0;
    comm_status.success_rate=0;

    int num = 5;
    int count = 0;
    int count_num = 0;
    int correct_num = 0;

    while (1) {
        //Clear receive buffer, set send buffer to something sane
        // memset(recvbuf, 0xA5, 129);
        // sprintf(sendbuf, "This is the receiver, sending data for transmission number %04d.", n);

        //Set up a transaction of 128 bytes to send/receive
        sendbuf[0]=0xbc;
        sendbuf[1]=0x01;
        sendbuf[2]=0x02;
        sendbuf[3]=0x03;
        sendbuf[4]=0x04;
        t.length = 5 * 8;
        t.tx_buffer = sendbuf;
        t.rx_buffer = recvbuf;
        /* This call enables the SPI slave interface to send/receive to the sendbuf and recvbuf. The transaction is
        initialized by the SPI master, however, so it will not actually happen until the master starts a hardware transaction
        by pulling CS low and pulsing the clock etc. In this specific example, we use the handshake line, pulled up by the
        .post_setup_cb callback that is called as soon as a transaction is ready, to let the master know it is free to transfer
        data.
        */
        ret = spi_slave_transmit(RCV_HOST, &t, portMAX_DELAY);
        // if (recvbuf[0] == 0xab) {
        //     if (comm_status.rx_count == 0) {
        //         comm_status.rx_index_start = recvbuf[1] | (recvbuf[2] << 8);
        //     } else {
        //         comm_status.rx_index_end = recvbuf[1] | (recvbuf[2] << 8);
        //     }
        //     comm_status.rx_count++;
        //     int rx_real_count = comm_status.rx_index_end - comm_status.rx_index_start + 1;
        //     comm_status.success_rate = comm_status.rx_count * 100 / rx_real_count;
        //     if (comm_status.rx_count % 100 == 0) {
        //         // std::cout << "uart hit rate: " << (comm_status.success_rate) << std::endl;
        //         printf("uart hit rate: %d\n",comm_status.success_rate);
        //     }
        // if (recvbuf[0]==0xab){
            printf("Received:");
            for(int i=0;i<num;++i){
                printf("%d ", (int)recvbuf[i]);
            }
            printf("\n");
        // }

            // for(int i =1;i<num;++i){
            //     if((int)recvbuf[i]==i)correct_num++;
            // }
            // printf("%d\n",correct_num);
            // if(correct_num==num){
            //     count++;
            // }
            // correct_num = 0;
            count_num++;
            // if(count_num==100){
            //     printf("%d",count);
            //     count = 0;
            //     count_num = 0;
            //     printf("\n");
            // }
        // }
        //spi_slave_transmit does not return until the master has done a transmission, so by here we have sent our data and
        //received data from the master. Print it.
       
        n++;
    }

}
